// 앞부분 문제의 비교적 쉬운 난이도로 출제되는 경향이 있다.

/**
현재 상황에서 당장 가장 좋아 보이는 상황만을 선택하는 알고리즘이다.
흔히 그리디 알고리즘, 혹은 탐욕법이라고 불리기도 한다.
최적의 해를 구하기 위한 근사적인 방법으로 사용될 때가 많다

현실 세계의 많은 상황에서는, 단순한 탐욕 알고리즘으로는 최적의 해를 놓칠 수 있다.
하지만, 
최적의 해에 가까운 답을 뱉는 것을 고려하면 현실에서의 다양한 프로그램에서 "근사
해"를 구하는 목적으로 사용되곤 한다

* 일반적으로 탐욕 알고리즘 유형에서는, 탐욕 방법으로 최적의 해가 보장되는 문제가 출제된다 *
접근방법
1. 방법 고안하기: 현재 상황에서 어떤 것을 선택할지 알고리즘을 고안한다.
2. 정당성 확인하기: 자신이 고안한 알고리즘이 항상 최적의 해를 보장하는지 확인한다.(증명 단계)

ex) 거스름돈 문제
카운터에 500원, 100원, 50원, 10원짜리 동전이 무수히 많이 존재한다.
손님에게 6,480원을 거슬러 주어야 할 때, 동전 개수의 최솟값은?
 */
